Repository: Marcin-Kwiatkowski-NA/ride-sharing-frontend
Catalog: lib/l10n/app_*.arb
Languages: pl

# appTitle
source: Vamos Ride Sharing
pl: Vamos

source: Retry
pl: Ponów

source: Cancel
pl: Anuluj

source: Save
pl: Zapisz

# comingSoon
source: {feature} coming soon!
pl: {feature} — wkrótce!

source: OR
pl: LUB

source: Required
pl: Wymagane

# navRides
source: Rides
pl: Przejazdy

# navPackages
source: Packages
pl: Paczki

# navProfile
source: Profile
pl: Profil

# navMessages
source: Messages
pl: Wiadomości

# loginTitle
source: Login
pl: Logowanie

# passwordLabel
source: Password
pl: Hasło

# enterEmail
source: Enter your email
pl: Podaj adres e-mail

# enterValidEmail
source: Enter a valid email
pl: Podaj poprawny adres e-mail

# enterPassword
source: Enter your password
pl: Podaj hasło

source: Continue with Google
pl: Kontynuuj z Google

# dontHaveAccount
source: Don't have an account?
pl: Nie masz konta?

source: Sign up
pl: Zarejestruj się

# createAccountTitle
source: Create Account
pl: Utwórz konto

# displayNameLabel
source: Display Name
pl: Wyświetlana nazwa

# displayNameHelper
source: This is the name other users will see.
pl: Tę nazwę będą widzieć inni użytkownicy.

# enterDisplayName
source: Enter a display name
pl: Podaj wyświetlaną nazwę

# displayNameMinLength
source: Display name must be at least 2 characters
pl: Nazwa musi mieć co najmniej 2 znaki

# confirmPasswordLabel
source: Confirm Password
pl: Potwierdź hasło

# confirmPassword
source: Confirm your password
pl: Potwierdź swoje hasło

source: Passwords do not match
pl: Hasła się nie zgadzają

source: Enter a password
pl: Podaj hasło

# passwordMinLength
source: Password must be at least 6 characters
pl: Hasło musi mieć co najmniej 6 znaków

# alreadyHaveAccount
source: Already have an account?
pl: Masz już konto?

source: Google sign-up coming soon!
pl: Rejestracja przez Google wkrótce!

# searchSemanticLabel
source: Search for rides. {label}
pl: Szukaj przejazdów. {label}

# swapOriginDestination
source: Swap origin and destination
pl: Zamień początek i cel

# whereToSearch
source: Where to?
pl: Dokąd?

# searchFromCity
source: From {city}
pl: Z {city}

# searchToCity
source: To {city}
pl: Do {city}

source: Post
pl: Dodaj

source: What are you posting?
pl: Co chcesz dodać?

source: Offer a Ride
pl: Oferuję przejazd

# offerARideSubtitle
source: I'm driving and have empty seats.
pl: Jadę samochodem i mam wolne miejsca.

source: Request a Ride
pl: Szukam przejazdu

# requestARideSubtitle
source: I need a driver for a specific date.
pl: Potrzebuję kierowcy na konkretny termin.

source: Today
pl: Dziś

source: Tomorrow
pl: Jutro

source: Previous day
pl: Poprzedni dzień

source: Next day
pl: Następny dzień

# partOfDayMorning
source: Morning
pl: Rano

# partOfDayAfternoon
source: Afternoon
pl: Popołudnie

# partOfDayEvening
source: Evening
pl: Wieczór

# partOfDayNight
source: Night
pl: Noc

source: Any time
pl: Dowolna pora

source: Flexible
pl: Elastycznie

source: Ask driver
pl: Zapytaj kierowcę

source: Ask about price
pl: Zapytaj o cenę

source: Ask passenger
pl: Zapytaj pasażera

# seatCount
source: {count, plural, one{1 seat} other{{count} seats}}
pl: {count, plural, one{1 miejsce} few{{count} miejsca} many{{count} miejsc} other{{count} miejsca}}

# passengerCount
source: {count, plural, one{1 passenger} other{{count} passengers}}
pl: {count, plural, one{1 pasażer} few{{count} pasażerów} many{{count} pasażerów} other{{count} pasażerów}}

# rideCount
source: {count, plural, one{1 ride} other{{count} rides}}
pl: {count, plural, one{1 przejazd} few{{count} przejazdy} many{{count} przejazdów} other{{count} przejazdu}}

source: Price per seat
pl: Cena za miejsce

source: Available seats
pl: Wolne miejsca

source: Budget
pl: Budżet

source: Passengers
pl: Pasażerowie

source: Passengers Needed
pl: Liczba pasażerów

source: Verified member
pl: Zweryfikowany użytkownik

source: Community listing
pl: Ogłoszenie społecznościowe

source: Source: Facebook
pl: Źródło: Facebook

# callLabel
source: Call
pl: Zadzwoń

source: Open Facebook post
pl: Otwórz post na Facebooku

source: Send email
pl: Wyślij e-mail

source: Ride Details
pl: Szczegóły przejazdu

source: Ride Request
pl: Prośba o przejazd

source: Offering a ride
pl: Oferuje przejazd

source: Looking for a ride
pl: Szuka przejazdu

# contactUser
source: Contact {name}
pl: Kontakt z {name}

source: Facebook User
pl: Użytkownik Facebooka

# priceLabel
source: Price
pl: Cena

# availabilityLabel
source: Availability
pl: Dostępność

# driverLabel
source: DRIVER
pl: KIEROWCA

# passengerLabel
source: PASSENGER
pl: PASAŻER

# driverFallbackName
source: Driver
pl: Kierowca

# passengerFallbackName
source: Passenger
pl: Pasażer

# statusOpen
source: Open
pl: Otwarte

# statusFull
source: Full
pl: Pełne

# statusCompleted
source: Completed
pl: Zakończone

# statusCancelled
source: Cancelled
pl: Anulowane

# statusSearching
source: Searching
pl: Szukam

# statusBooked
source: Booked
pl: Zarezerwowane

# statusExpired
source: Expired
pl: Wygasłe

# statusBanned
source: Banned
pl: Zablokowane

# noRidesFound
source: No rides found matching your criteria.
pl: Nie znaleziono przejazdów pasujących do Twoich kryteriów.

# noPassengerRequests
source: No passenger requests found matching your criteria.
pl: Nie znaleziono próśb pasażerów pasujących do Twoich kryteriów.

source: My Offers
pl: Moje ogłoszenia

# filterAll
source: All
pl: Wszystkie

# filterRides
source: Rides
pl: Przejazdy

# filterPassengers
source: Passengers
pl: Pasażerowie

source: Failed to load offers
pl: Nie udało się załadować ogłoszeń

source: No offers yet
pl: Brak ogłoszeń

source: Post Your Ride
pl: Dodaj przejazd

# offerARideHeader
source: Offer a Ride
pl: Oferuję przejazd

# originCityLabel
source: Origin City
pl: Miasto początkowe

# destinationCityLabel
source: Destination City
pl: Miasto docelowe

# originRequired
source: Origin City is required
pl: Miasto początkowe jest wymagane

# destinationRequired
source: Destination City is required
pl: Miasto docelowe jest wymagane

source: Select origin from suggestions
pl: Wybierz miasto z listy podpowiedzi

source: Select destination from suggestions
pl: Wybierz cel z listy podpowiedzi

source: Must differ from origin
pl: Musi się różnić od miasta początkowego

source: Date of Departure
pl: Data wyjazdu

source: Select departure date
pl: Wybierz datę wyjazdu

source: Time of Day
pl: Pora dnia

source: Time of Departure
pl: Godzina wyjazdu

source: Select departure time
pl: Wybierz godzinę wyjazdu

# availableSeatsLabel
source: Available Seats
pl: Wolne miejsca

# seatsRange
source: 1-8 seats allowed
pl: Dozwolone 1–8 miejsc

# pricePerSeatLabel
source: Price per Seat
pl: Cena za miejsce

source: Ride Description (Optional)
pl: Opis przejazdu (opcjonalnie)

# maxCharacters
source: Max {count} characters
pl: Maks. {count} znaków

source: Post Ride
pl: Dodaj przejazd

source: Post Seat Request
pl: Dodaj prośbę o przejazd

# findARideHeader
source: Find a Ride
pl: Szukam przejazdu

# passengersRange
source: 1-8 passengers allowed
pl: Dozwolone 1–8 pasażerów

source: Budget (Optional)
pl: Budżet (opcjonalnie)

source: Description (Optional)
pl: Opis (opcjonalnie)

# seatRequestCreated
source: Seat request created successfully!
pl: Prośba o przejazd została dodana!

# profileTitle
source: Profile
pl: Profil

# logInToSeeProfile
source: Log in to see your profile
pl: Zaloguj się, aby zobaczyć swój profil

source: Log In / Sign Up
pl: Zaloguj / Zarejestruj

# trustAndVerification
source: Trust & Verification
pl: Zaufanie i weryfikacja

source: Email verification
pl: Weryfikacja e-mail

source: Phone verification
pl: Weryfikacja telefonu

# phoneLabel
source: Phone
pl: Telefon

source: Statistics
pl: Statystyki

source: Rides Given
pl: Udzielone przejazdy

source: Rides Taken
pl: Odbyte przejazdy

source: Rating
pl: Ocena

source: Edit Profile
pl: Edytuj profil

# updatePersonalInfo
source: Update your personal information
pl: Zaktualizuj swoje dane osobowe

# viewRideHistory
source: View your ride history
pl: Zobacz historię przejazdów

source: Logout
pl: Wyloguj

# phoneNumberLabel
source: Phone Number
pl: Numer telefonu

# phoneHint
source: Enter your phone number (optional)
pl: Podaj numer telefonu (opcjonalnie)

# bioLabel
source: Bio
pl: O mnie

# bioHint
source: Tell others about yourself (optional)
pl: Napisz coś o sobie (opcjonalnie)

# displayNameRequired
source: Display name is required
pl: Nazwa wyświetlana jest wymagana

source: Save Changes
pl: Zapisz zmiany

# profileUpdatedSuccess
source: Profile updated successfully
pl: Profil został zaktualizowany

source: Failed to update profile
pl: Nie udało się zaktualizować profilu

source: Profile Completeness
pl: Kompletność profilu

source: Profile complete!
pl: Profil kompletny!

source: {percent}% complete
pl: {percent}% ukończone

source: Complete
pl: Uzupełnij

source: Profile not available
pl: Profil niedostępny

# profileNotAvailableMessage
source: This profile cannot be displayed right now.
pl: Tego profilu nie można teraz wyświetlić.

source: About
pl: O mnie

# noBioYet
source: No bio added yet.
pl: Brak opisu.

source: Rides
pl: Przejazdy

source: Reviews
pl: Opinie

source: Vehicle
pl: Pojazd

source: My Bookings
pl: Moje rezerwacje

source: Bookings Coming Soon
pl: Rezerwacje wkrótce

# bookingsComingSoonMessage
source: The booking feature is being redesigned. Check back later!
pl: Funkcja rezerwacji jest w trakcie przebudowy. Sprawdź później!

# messagesTitle
source: Messages
pl: Wiadomości

# chatTitle
source: Chat
pl: Czat

source: Could not load messages
pl: Nie udało się załadować wiadomości

source: No messages yet
pl: Brak wiadomości

# startConversation
source: Start a conversation from a ride listing
pl: Rozpocznij rozmowę z poziomu ogłoszenia

# sendMessageToStart
source: Send a message to start the conversation
pl: Wyślij wiadomość, aby rozpocząć rozmowę

source: Type a message...
pl: Napisz wiadomość...

# timeNow
source: now
pl: teraz

# timeMinutesAgo
source: {count}m
pl: {count} min

# timeHoursAgo
source: {count}h
pl: {count} godz.

# timeDaysAgo
source: {count}d
pl: {count} dn.

# packagesTitle
source: Packages
pl: Paczki

# packagesComingSoon
source: Coming soon
pl: Wkrótce

# errorTitle
source: Error
pl: Błąd

source: Page not found
pl: Nie znaleziono strony

# pageNotFoundMessage
source: The page you are looking for does not exist.
pl: Strona, której szukasz, nie istnieje.

source: Go Home
pl: Wróć na stronę główną

# settingsLanguage
source: Language
pl: Język

# languageSystem
source: System
pl: Systemowy

# effectiveLanguage
source: Currently using: {language}
pl: Aktualnie: {language}

source: Search Rides
pl: Szukaj przejazdów

source: Search Passengers
pl: Szukaj pasażerów

# fromLabel
source: From
pl: Skąd

# toLabel
source: To
pl: Dokąd

# dateLabel
source: Date
pl: Data

source: Any date
pl: Dowolna data

source: Clear date
pl: Wyczyść datę

source: Clear All
pl: Wyczyść wszystko

source: Choose city
pl: Wybierz miasto

source: Search city
pl: Szukaj miasta

source: Where are you going?
pl: Dokąd jedziesz?

# nudgeRouteTime
source: Need a different time for {origin} → {destination}?
pl: Potrzebujesz innej godziny na trasie {origin} → {destination}?

# nudgeDateFallback
source: Nothing on {date}? Post your own request.
pl: Nic na {date}? Dodaj własne ogłoszenie.

# nudgeGeneric
source: Not finding what you need? Post a request and let drivers come to you.
pl: Nie znajdujesz tego, czego szukasz? Dodaj ogłoszenie, a kierowcy sami się zgłoszą.

source: Post a request
pl: Dodaj ogłoszenie

source: Post Request
pl: Dodaj ogłoszenie

# noRidesFoundShort
source: No rides found
pl: Nie znaleziono przejazdów

# zeroResultsHeadline
source: Don't wait. Let drivers find you.
pl: Nie czekaj. Niech kierowcy znajdą Ciebie.

# zeroResultsRouteDate
source: Post a request for {origin} to {destination} on {date}.
pl: Dodaj ogłoszenie na trasie {origin} do {destination} na {date}.

# zeroResultsRoute
source: Post a request for {origin} to {destination}.
pl: Dodaj ogłoszenie na trasie {origin} do {destination}.

# zeroResultsOriginDate
source: Post a request from {origin} on {date}.
pl: Dodaj ogłoszenie z {origin} na {date}.

# zeroResultsOrigin
source: Post a request from {origin} and let drivers find you.
pl: Dodaj ogłoszenie z {origin} i pozwól kierowcom Cię znaleźć.

# zeroResultsGeneric
source: Post a request for your route and let drivers find you.
pl: Dodaj ogłoszenie na swoją trasę i pozwól kierowcom Cię znaleźć.

# negotiablePrice
source: Price negotiable
pl: Cena do negocjacji

source: Add stop
pl: Dodaj przystanek

source: Remove stop
pl: Usuń przystanek

# intermediateStopLabel
source: Stop {number}
pl: Przystanek {number}

# stopDepartureTime
source: Departure time at stop
pl: Godzina odjazdu z przystanku
